reference/phases.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Pallet - Phases</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-06-17 Thu"/>
<meta name="author" content="Hugo Duncan"/>
<meta name="description" content="Pallet Phases"/>
<meta name="keywords" content="pallet phase phases configuration crates"/>
<link rel="stylesheet" type="text/css" href="../doc.css" />
</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<h1 class="title">Pallet - Phases</h1>


<p>
A phase specifies a sequence of crates to be executed.  A phase can be defined
as part of a <a href="node_types.html">node type</a>, or inline in a <a href="operations.html"><code>configure</code> or <code>lift</code> invocation</a>, using
the <code>phase</code> macro.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">:bootstrap </h2>
<div class="outline-text-2" id="text-1">


<p>
The <code>:bootstrap</code> phase is applied whenever pallet starts a new node.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">:configure </h2>
<div class="outline-text-2" id="text-2">


<p>
The <code>:configue</code> phase is applied by default by both the <code>converge</code> and the
<code>lift</code> commands.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><code>phase</code> macro </h2>
<div class="outline-text-2" id="text-3">


<p>
The <code>phase</code> macro can be used to carry out ad-hoc configuration or
administration tasks. In this example we install <code>curl</code> on all running <code>mytag</code>
nodes.
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span> 'pallet.core)
(<span style="color: #0000ff;">require</span> 'pallet.compute)
(<span style="color: #0000ff;">require</span> 'pallet.resource)
(<span style="color: #0000ff;">require</span> 'pallet.resource.package)

(<span style="color: #4682b4;">def</span> <span style="color: #0000ff;">service</span>
     (pallet.compute/compute-service-from-settings))
(pallet.core/defnode mytag {})
(pallet.core/lift mytag service
  (pallet.resource/phase (pallet.resource.package/package <span style="color: #f4a460;">"curl"</span>)))
</pre>



</div>
</div>
<div id="postamble">
<p class="author"> Author: Hugo Duncan
</p>
<p class="date"> Date: 2010-06-17 Thu</p>
<p class="creator">HTML generated by org-mode 6.36trans in emacs 24</p>
</div>
</div>
</body>
</html>
